# Configure where our applications go
cask_args appdir: "/Applications"


# Install scripts we want
brew "archey"
brew "git"
brew "mas"
brew "npm"
brew "python3"
brew "qt5"
brew "pyqt5"
brew "pkg-config"
brew "libpng"
brew "freetype"

# Utility to download content from youtube, the latast Tatort or whatever
# else you want to watch offline
brew 'youtube-dl'

# Get brew cask for apps
tap "caskroom/cask"


# Install the apps we want
cask "iterm2"
cask "google-chrome"
cask "vlc"
cask "dropbox"
cask "spotify"
cask "sublime-text"
cask "skype"
cask "typora"
cask "skitch"
cask "teamviewer"
cask "grandperspective"
cask "adobe-creative-cloud"
cask "qbittorrent"
cask "the-unarchiver"
cask "appcleaner"
cask "osxfuse"
cask "font-source-code-pro"
cask "plex-media-server"
cask "qlmarkdown"
cask "qlstephen"
cask "qlcolorcode"