# Configure where our applications go
cask_args appdir: "/Applications"


# install scripts we want
brew "archey"
brew "git"
brew "mas"
brew "npm"
brew "python3"
brew "qt5"
brew "pyqt5"
brew "pkg-config"
brew "libpng"
brew "freetype"

# get brew cask for apps
tap "caskroom/cask"


# install the apps we want
cask "google-chrome"
cask "vlc"
cask "dropbox"
cask "spotify"
cask "sublime-text"
cask "evernote"
cask "skype"
cask "typora"
cask "skitch"
cask "teamviewer"
casl "grandperspective"
